## Pandas 基本使用

In [61]:
import numpy as np 
import pandas as pd
from pandas import Series, DataFrame

### pandas 的数据结构介绍

#### Series

Series是一种类似于一维数组的对象，它由一组数据（各种NumPy数据类型）以及一组与之相关的数据标签（即索引）组成

In [3]:
obj = Series([4, 7, -5, 10])

In [5]:
obj

0     4
1     7
2    -5
3    10
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5, 10])

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd'])

obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [10]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
obj2['a']

4

In [12]:
obj2[['a', 'b', 'c']]

a    4
b    7
c   -5
dtype: int64

使用Numpy 函数或者类似Numpy 的运算都会保留索引值的链接

In [14]:
obj2[obj2 > 0]

a    4
b    7
d    3
dtype: int64

In [15]:
obj2 * 2

a     8
b    14
c   -10
d     6
dtype: int64

还可以将Series看成一个定长的有序字典, 因为它是索引值到数据值的一个映射

In [16]:
'b' in obj2

True

通过字典创建Series

In [17]:
sdata = {'Ohio': 3500, 'Texas': 34990, 'Oregon': 12009, 'Utah': 12098}

obj3 = Series(sdata)

obj3

Ohio       3500
Texas     34990
Oregon    12009
Utah      12098
dtype: int64

In [32]:
states = ['California', 'Ohio', 'Oregon', 'Tesxas']

obj4 = Series(sdata, index=states)

obj4

California        NaN
Ohio           3500.0
Oregon        12009.0
Tesxas            NaN
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Tesxas         True
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Tesxas        False
dtype: bool

In [22]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Tesxas         True
dtype: bool

In [23]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Tesxas        False
dtype: bool

In [24]:
obj3 + obj4

California        NaN
Ohio           7000.0
Oregon        24018.0
Tesxas            NaN
Texas             NaN
Utah              NaN
dtype: float64

In [36]:
obj4.name = 'population'

In [37]:
obj4.index.name = 'state'

In [38]:
obj4

state
California        NaN
Ohio           3500.0
Oregon        12009.0
Tesxas            NaN
Name: population, dtype: float64

In [39]:
obj

0     4
1     7
2    -5
3    10
dtype: int64

In [40]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [41]:
obj

Bob       4
Steve     7
Jeff     -5
Ryan     10
dtype: int64

#### DataFrame

In [43]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
    }
frame = DataFrame(data)

In [44]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [45]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [51]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'xxx'], index=['one', 'two', 'three', 'four', 'five', 'six'])

In [52]:
frame2

       year   state  pop  xxx
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [53]:
frame2.columns

Index(['year', 'state', 'pop', 'xxx'], dtype='object')

In [54]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [55]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [57]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
xxx       NaN
Name: three, dtype: object

In [59]:
frame2['debt'] = 16.5

In [62]:
frame2['debt'] = np.arange(6.)

In [64]:
val = pd.Series([-1.2, -1.5, -1.7], index=['one', 'two', 'four'])
frame2['debt'] = val

In [66]:
frame2['eastern'] = frame2.state == 'Ohio'

In [68]:
del frame2['eastern']

In [69]:
frame2

       year   state  pop  xxx  debt
one    2000    Ohio  1.5  NaN  -1.2
two    2001    Ohio  1.7  NaN  -1.5
three  2002    Ohio  3.6  NaN   NaN
four   2001  Nevada  2.4  NaN  -1.7
five   2002  Nevada  2.9  NaN   NaN
six    2003  Nevada  3.2  NaN   NaN

In [72]:
pop = {
    'Nevada': {2001: 2.4, 2002: 22.9},
    'Ohio': {2000: 1.5, 2001: 2.4, 2002: 22.9}
}
frame3 = DataFrame(pop)

In [73]:
frame3

      Nevada  Ohio
2001     2.4   2.4
2002    22.9  22.9
2000     NaN   1.5

In [74]:
frame3.T

        2001  2002  2000
Nevada   2.4  22.9   NaN
Ohio     2.4  22.9   1.5

In [76]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   2.4
2002    22.9  22.9
2003     NaN   NaN

In [81]:
pdata = {
    'Ohio': frame3['Ohio'][:-1],
    'Nevada': frame3['Nevada'][:2]
}

DataFrame(pdata)

      Ohio  Nevada
2001   2.4     2.4
2002  22.9    22.9

In [82]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

frame3

state  Nevada  Ohio
year
2001      2.4   2.4
2002     22.9  22.9
2000      NaN   1.5

In [84]:
frame2.values

array([[2000, 'Ohio', 1.5, nan, -1.2],
       [2001, 'Ohio', 1.7, nan, -1.5],
       [2002, 'Ohio', 3.6, nan, nan],
       [2001, 'Nevada', 2.4, nan, -1.7],
       [2002, 'Nevada', 2.9, nan, nan],
       [2003, 'Nevada', 3.2, nan, nan]], dtype=object)

### 索引对象

In [85]:
obj = Series(range(3), index=['a', 'b', 'c'])

index = obj.index

In [86]:
index

Index(['a', 'b', 'c'], dtype='object')

In [87]:
index[1:]

Index(['b', 'c'], dtype='object')

index对象是不可变的, 不能对其进行修改

In [88]:
labels = pd.Index(np.arange(3))

labels

Int64Index([0, 1, 2], dtype='int64')

In [89]:
obj2 = Series([1.5, -2.5, 0], index=labels)

obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [90]:
obj2.index is labels

True

In [91]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

## 基本使用

### 重新索引

In [93]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [95]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [96]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [97]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [98]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [99]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [100]:
frame.reindex(['a', 'b', 'c', 'd'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [101]:
states = ['Texas', 'Utah', 'Califrnia']

frame.reindex(columns=states)

   Texas  Utah  Califrnia
a      1   NaN        NaN
c      4   NaN        NaN
d      7   NaN        NaN

### 丢弃指定轴上的项

In [102]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [103]:
new_obj = obj.drop('c')

new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [105]:
obj.drop(['a', 'b', 'c'])

d    3.0
e    4.0
dtype: float64

In [106]:
data = DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [109]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [111]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [112]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [114]:
obj.drop('c', inplace=True)

obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### 索引, 选取和过滤

In [115]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [119]:
obj['b']

1.0

In [120]:
obj[1]

1.0

In [126]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [122]:
obj[['a', 'b', 'd']]

a    0.0
b    1.0
d    3.0
dtype: float64

In [123]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [124]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [127]:
obj['b': 'c']

b    1.0
c    2.0
dtype: float64

In [128]:
data = DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [130]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [132]:
data[['two', 'one']]

          two  one
Ohio        1    0
Colorado    5    4
Utah        9    8
New York   13   12

In [133]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [135]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [136]:
data[data < 5] = 0

In [137]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### 用loc 和 iloc 进行选取

In [141]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [143]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [144]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [145]:
data.iloc[[0, 3], [0, 1, 2]]

          one  two  three
Ohio        0    0      0
New York   12   13     14

In [146]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [147]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### 整数索引

In [152]:
ser = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [154]:
ser[-1]

2.0

为了防止歧义, 使用loc 和iloc 分别取值

### 算术运算和数据对齐

In [156]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [159]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [162]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [165]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [166]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [174]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [175]:
df1 = pd.DataFrame({'A': [1, 2]})

df2 = pd.DataFrame({'B': [3, 4]})

In [178]:
df2 - df1

    A   B
0 NaN NaN
1 NaN NaN

### 在算数方法中填充值

In [180]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [181]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [182]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [183]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [184]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [186]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### DataFrame 和 Series 之间的运算

In [187]:
arr = np.arange(12.).reshape((3, 4))

In [190]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [192]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [196]:
series = frame.iloc[0]

In [197]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [198]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [199]:
series2 = pd.Series(range(3), index=list('bef'))

In [201]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [202]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [203]:
series3 = frame['d']

In [204]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [206]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 函数应用和映射

In [208]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [209]:
frame

               b         d         e
Utah    0.623491 -0.340830 -0.480102
Ohio    0.093295  1.248156 -0.589623
Texas  -2.081336  0.751407 -0.050120
Oregon -0.759847  0.518968 -0.613883

In [210]:
np.abs(frame)

               b         d         e
Utah    0.623491  0.340830  0.480102
Ohio    0.093295  1.248156  0.589623
Texas   2.081336  0.751407  0.050120
Oregon  0.759847  0.518968  0.613883

In [211]:
f = lambda x: x.max() - x.min()

frame.apply(f)

b    2.704827
d    1.588986
e    0.563763
dtype: float64

In [212]:
frame.apply(f, axis=1)

Utah      1.103593
Ohio      1.837779
Texas     2.832743
Oregon    1.278815
dtype: float64

In [215]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [216]:
frame.apply(f)

            b         d         e
min -2.081336 -0.340830 -0.613883
max  0.623491  1.248156 -0.050120

In [217]:
format = lambda x: '%.2f' %x 

frame.applymap(format)

            b      d      e
Utah     0.62  -0.34  -0.48
Ohio     0.09   1.25  -0.59
Texas   -2.08   0.75  -0.05
Oregon  -0.76   0.52  -0.61

In [219]:
frame['e'].map(format)

Utah      -0.48
Ohio      -0.59
Texas     -0.05
Oregon    -0.61
Name: e, dtype: object

### 排序和排名

In [222]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [224]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [226]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=list('dabc'))

In [228]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [232]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [233]:
obj = pd.Series([4, 7, -3, 2])

In [235]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [236]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [239]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [240]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [247]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [248]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [250]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [251]:
obj = pd.Series([0, 1, 2, 3, 4, 5, 6, 7])

In [253]:
obj.rank()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
dtype: float64

In [254]:
obj2 = pd.Series([0, 0, 1, 1, 2, 2, 3, 3, 4, 4])

In [255]:
obj2.rank()

0    1.5
1    1.5
2    3.5
3    3.5
4    5.5
5    5.5
6    7.5
7    7.5
8    9.5
9    9.5
dtype: float64

0 值有两个处于第一个和第二个位置上, 所以取值就是 (1 + 2) / 2 = 1.5, 以此类推

method 参数
- method='average' (默认值) 那么这两个人就占据了前两名，分不出谁第 1，谁第 2，就把两人的名次算个平均数，都算 1.5 名，这样下一个人就是第3名
- method='max' 两人并列第 2 名，下一个人是第 3 名。
- method='min' 两人并列第 1 名，下一个人是第 3 名。
- method='dense' 两人并列第 1 名，但下一个人是第 2 名。
- method='first'

### 带重复标签的轴索引

In [256]:
obj = pd.Series(range(5), index=list('aabbc'))

In [259]:
obj.index.is_unique

False

In [260]:
obj['a']

a    0
a    1
dtype: int64

In [261]:
df = DataFrame(np.random.randn(4, 3), index=list('aabb'))

In [263]:
df.loc['b']

          0         1         2
b -0.730848  1.212912  0.187070
b -0.012468  0.004719 -1.437464

### 汇总和计算描述统计

In [264]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=list('abcd'), columns=['one', 'two'])

In [267]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [268]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [269]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

参数含义
- axis: 轴
- skipna: 排除缺失值, 默认值为True
- level: 如果轴是层次化索引的, 则根据level分组约简

In [270]:
df.idxmax()

one    b
two    d
dtype: object

In [272]:
df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [274]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [275]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [276]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [277]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [283]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [284]:
import pandas_datareader.data as web

In [285]:
web.get_data_yahoo('IBM')

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2015-01-14,156.490005,153.740005,154.860001,155.800003,4690300.0,125.546654
2015-01-15,156.970001,154.160004,156.690002,154.570007,4248400.0,124.555489
2015-01-16,157.630005,153.820007,153.820007,157.139999,5756000.0,126.626427
2015-01-20,157.330002,154.029999,156.699997,156.949997,8392800.0,126.473312
2015-01-21,154.500000,151.070007,153.029999,152.089996,11897100.0,122.557053
...,...,...,...,...,...,...
2020-01-07,134.960007,133.399994,133.690002,134.190002,3090800.0,134.190002
2020-01-08,135.860001,133.919998,134.509995,135.309998,4346000.0,135.309998
2020-01-09,136.789993,135.309998,135.740005,136.740005,3730600.0,136.740005
2020-01-10,137.869995,136.309998,137.000000,136.690002,3255400.0,136.690002
2020-01-13,136.639999,135.070007,135.479996,136.600006,3531000.0,136.600006